const news = [
    {
        "title": "نماوا",
        "date": "1400/5/15",
        "img": "img1.jpg",
        "text": "گروه شرکت‌های شاتل با بیش از ۱۳۰۰ نفر نیروی انسانی متخصص، با گسترش دامنه­‌ی توزیع خدمات خود در استان­‌های مختلف از طریق نزدیک به ۴۰۰ دفتر نمایندگی، یک هزار عامل فروش و بیش از ۲۵۰۰ نفر نیروی انسـانی توانسته است سراسر کشور را تحت پوشش خدمات خود قرار دهد و بزرگ‌ترین سهم از مشتریان بازار اینترنت و خدمات تکمیلی آن در کشور را به‌ویژه در حوزه‌ی ارایه‌ی خدمات اینترنت پرسرعت +ADSL2 به خویش اختصاص دهد. ",
        "url":"https://www.namava.ir/"
    },
    {
        "title": "دلسا",
        "date": "1400/5/16",
        "img": "img2.jpg",
        "text": "گروه شرکت‌های شاتل با بیش از ۱۳۰۰ نفر نیروی انسانی متخصص، با گسترش دامنه­‌ی توزیع خدمات خود در استان­‌های مختلف از طریق نزدیک به ۴۰۰ دفتر نمایندگی، یک هزار عامل فروش و بیش از ۲۵۰۰ نفر نیروی انسـانی توانسته است سراسر کشور را تحت پوشش خدمات خود قرار دهد و بزرگ‌ترین سهم از مشتریان بازار اینترنت و خدمات تکمیلی آن در کشور را به‌ویژه در حوزه‌ی ارایه‌ی خدمات اینترنت پرسرعت +ADSL2 به خویش اختصاص دهد. ",
        "url":""
    },
    {
        "title": "شاتل",
        "date": "1400/5/17",
        "img": "img3.jpg", 
        "text": "گروه شرکت‌های شاتل با بیش از ۱۳۰۰ نفر نیروی انسانی متخصص، با گسترش دامنه­‌ی توزیع خدمات خود در استان­‌های مختلف از طریق نزدیک به ۴۰۰ دفتر نمایندگی، یک هزار عامل فروش و بیش از ۲۵۰۰ نفر نیروی انسـانی توانسته است سراسر کشور را تحت پوشش خدمات خود قرار دهد و بزرگ‌ترین سهم از مشتریان بازار اینترنت و خدمات تکمیلی آن در کشور را به‌ویژه در حوزه‌ی ارایه‌ی خدمات اینترنت پرسرعت +ADSL2 به خویش اختصاص دهد. ",
        "url":"https://www.shatel.ir/"
    }
]
